step_reports/real_overhead_suite/pd/logs/nsys_decode_bench_run1.log
2026-04-16 19:43:52,255 - modelscope - INFO - Target directory already exists, skipping creation.
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url='http://127.0.0.1:8000', host='0.0.0.0', port=None, ready_check_timeout_sec=300, dataset_name='random', dataset_path='', model='LLM-Research/Meta-Llama-3.1-8B-Instruct', served_model_name=None, tokenizer='LLM-Research/Meta-Llama-3.1-8B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/workspace/step_reports/real_overhead_suite/pd/results/nsys_decode_bench_run1.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=2, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 300s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=LLM-Research/Meta-Llama-3.1-8B-Instruct is not a local folder and is not a valid model identifier listed on 'https://huggingface.co/models'
If this is a private repository, make sure to pass a token having permission to this repo either by logging in with `hf auth login` or by passing `token=<your_token>`

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url='http://127.0.0.1:8000', host='0.0.0.0', port=30000, ready_check_timeout_sec=300, dataset_name='random', dataset_path='', model='LLM-Research/Meta-Llama-3.1-8B-Instruct', served_model_name=None, tokenizer='LLM-Research/Meta-Llama-3.1-8B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file='/workspace/step_reports/real_overhead_suite/pd/results/nsys_decode_bench_run1.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=2, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

Downloading Model from https://www.modelscope.cn to directory: /root/.cache/modelscope/hub/models/LLM-Research/Meta-Llama-3.1-8B-Instruct
#Input tokens: 12917
#Output tokens: 6847
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [00:10<00:00,  9.60it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  10.42     
Total input tokens:                      12917     
Total input text tokens:                 12917     
Total generated tokens:                  6847      
Total generated tokens (retokenized):    6847      
Request throughput (req/s):              9.60      
Input token throughput (tok/s):          1239.87   
Output token throughput (tok/s):         657.23    
Peak output token throughput (tok/s):    1368.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          1897.09   
Concurrency:                             69.20     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7209.64   
Median E2E Latency (ms):                 7226.85   
P90 E2E Latency (ms):                    9411.86   
P99 E2E Latency (ms):                    10142.84  
---------------Time to First Token----------------
Mean TTFT (ms):                          5124.61   
Median TTFT (ms):                        5330.85   
P99 TTFT (ms):                           7685.59   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.60     
Median TPOT (ms):                        25.76     
P99 TPOT (ms):                           196.45    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           30.90     
Median ITL (ms):                         23.96     
P95 ITL (ms):                            33.47     
P99 ITL (ms):                            49.04     
Max ITL (ms):                            3643.51   
==================================================
[W416 19:44:11.174094528 AllocatorConfig.cpp:28] Warning: PYTORCH_CUDA_ALLOC_CONF is deprecated, use PYTORCH_ALLOC_CONF instead (function operator())